# ~/.dotfiles/Brewfile.server
# Homebrew Bundle — Mac Mini (agent-server) setup
# Headless server for OpenClaw, Claude Code, and background tasks.
#
# Usage:
#   brew bundle --file=~/.dotfiles/Brewfile.server --no-lock

# ============================================================================
# Taps
# ============================================================================

tap "shaunsingh/sfmono-nerd-font-ligaturized"

# ============================================================================
# Core CLI
# ============================================================================

brew "bat"                          # cat with syntax highlighting
brew "coreutils"                    # GNU core utilities
brew "eza"                          # modern ls replacement
brew "fd"                           # fast find alternative
brew "fzf"                          # fuzzy finder
brew "ripgrep"                      # fast grep (rg)
brew "tree"                         # directory tree view
brew "zoxide"                       # smart cd (z)
brew "stow"                         # dotfiles symlink manager

# ============================================================================
# Dev Productivity
# ============================================================================

brew "btop"                         # resource monitor
brew "gh"                           # GitHub CLI
brew "git-delta"                    # better git diffs
brew "jq"                           # JSON processor
brew "lazygit"                      # terminal UI for git
brew "mactop"                       # Apple Silicon monitor
brew "tlrc"                         # tldr pages client (Rust)
brew "glow"                         # render markdown in terminal
brew "duf"                          # modern df (disk free)
brew "dust"                         # modern du (disk usage)
brew "sd"                           # modern sed

# ============================================================================
# Shell & Editor
# ============================================================================

brew "neovim"                       # the one true editor
brew "starship"                     # cross-shell prompt
brew "tmux"                         # terminal multiplexer
brew "atuin"                        # shell history (skipped over SSH)
brew "navi"                         # cheatsheets (skipped over SSH)
brew "sesh"                         # tmux session manager

# ============================================================================
# Languages & Runtimes
# ============================================================================

brew "deno"                         # Deno runtime
brew "nvm"                          # Node version manager
brew "python@3.13"                  # Python 3.13
brew "uv"                           # fast Python package installer

# ============================================================================
# Media & Data
# ============================================================================

brew "ffmpeg"                       # audio/video Swiss army knife
brew "fastfetch"                    # system info
brew "csvlens"                      # CSV viewer in terminal

# ============================================================================
# Casks
# ============================================================================

cask "ghostty"                      # terminal emulator
cask "font-sf-mono-nerd-font-ligaturized" # Ghostty font
cask "font-symbols-only-nerd-font"  # icon fallback
